Opener-Initiative/opener/drivers/dectnrp/dectnrp_nrf91.c
static void log_fw_uuid(void)
{
	char fw_uuid_buf[64];

	int ret = nrf_modem_at_cmd(fw_uuid_buf, sizeof(fw_uuid_buf), "AT%%XMODEMUUID");
	if (ret == 0) {
		/* Get string that starts with " " after "%XMODEMUUID:",
		 * then move to the next string before "\r\n"
		 * which corresponds to the FW UUID string.
		 */
		char *fw_uuid = strstr(fw_uuid_buf, " ");
		fw_uuid++;
		char *fw_uuid_end = strstr(fw_uuid_buf, "\r\n");
		size_t off = fw_uuid_end - fw_uuid_buf - 1;
		fw_uuid_buf[off + 1] = '\0';
		LOG_WRN("MFW uuid:%s", fw_uuid);
	} else {
		LOG_ERR("MFW uuid:Unable to obtain UUID,err:%d,type:%d", nrf_modem_at_err(ret),
			nrf_modem_at_err_type(ret));
	}
}

static int nrf91_start(const struct device *dev)
{
	int ret = 0;
	struct nrf91_context *ctx = dev->data;
	LOG_INF("nrf91_start(%s)", dev->name);

	if (!atomic_test_bit(&ctx->state, RADIO_STATE_INITIALIZED)) {
		LOG_ERR("nrf91_start but !RADIO_STATE_INITIALIZED");
		ret = -EIO;
		goto error;
	} else if (atomic_test_bit(&ctx->state, RADIO_STATE_STARTED)) {
		ret = -EALREADY;
		goto error;
	} else {
		ret = nrf_modem_dect_phy_activate(NRF_MODEM_DECT_PHY_RADIO_MODE_LOW_LATENCY);
		if (ret < 0) {
			NET_ERR("nrf_modem_dect_phy_activate failed,%d", ret);
			ret = -EIO;
			goto error;
		}
		ret = k_sem_take(&ctx->modemlock, K_MSEC(100));
		if (ret < 0) {
			NET_ERR("nrf_modem_dect_phy_activate(), k_sem_take failed");
			ret = -EIO;
			goto error;
		}

		ctx->tx.count = 0;
		ctx->rx.count = 0;

		/*  Operations are allowed now. */
		atomic_set_bit(&ctx->state, RADIO_STATE_STARTED);
		k_sem_give(&ctx->operation); 
		NET_INFO("DECT radio nrf91 started");
	}

	goto out;
error:
	NET_INFO("dectnrp_nrf91 NOT initialized");
out:
	return ret;
}

static int nrf91_stop(const struct device *dev)
{
	struct nrf91_context *ctx = dev->data;
	LOG_INF("nrf91_stop(%s)", dev->name);

	if (!atomic_test_bit(&ctx->state, RADIO_STATE_STARTED)) {
		return -EALREADY;
	}

	int ret = nrf_modem_dect_phy_cancel(NRF_MODEM_DECT_PHY_HANDLE_CANCEL_ALL);
	if (ret < 0) {
		LOG_ERR("Failed to send 'PHY_HANDLE_CANCEL_ALL' to modem, %d", ret);
		ret = -EIO;
		goto error;
	}
	ret = k_sem_take(&ctx->modemlock, K_MSEC(100));
	if (ret < 0) {
		NET_ERR("nrf_modem_dect_phy_cancel(), k_sem_take failed");
		ret = -EIO;
		goto error;
	}

	ret = nrf_modem_dect_phy_deinit();
	if (ret < 0) {
		LOG_ERR("Failed to deinit modem, %d", ret);
		return -EIO;
	}
	ret = k_sem_take(&ctx->modemlock, K_MSEC(100));
	if (ret < 0) {
		NET_ERR("nrf_modem_dect_phy_deinit(), k_sem_take failed");
		ret = -EIO;
		goto error;
	}

	atomic_clear_bit(&ctx->state, RADIO_STATE_STARTED);
	NET_INFO("DECT radio nrf91 stopped");
	goto out;
error:
	NET_INFO("dectnrp_nrf91 NOT stopped");
out:
	return ret;
}

static int nrf91_get_capabilities(const struct device *dev, struct dectnrp_device_capabilities *caps)
{
	LOG_INF("nrf91_get_capabilities(%s)", dev->name);
	caps->hw_caps = (DECTNRP_HW_FILTER | DECTNRP_HW_TXTIME | DECTNRP_HW_RXTIME);
	return 0;
}

static int nrf91_configure(const struct device *dev, enum dectnrp_config_type type,
			   const struct dectnrp_config *config)
{
	struct nrf91_context *ctx = dev->data;
	LOG_INF("nrf91_configure(%s)", dev->name);

	int ret = 0;

	switch (type) {
	case DECTNRP_CONFIG_TYPE_EVENT_HANDLER: {
		ctx->upper_layer_event_handler = config->event_handler;
		break;
	}
	case DECTNRP_CONFIG_TYPE_NETWORK_ID: {
		ctx->network_id = config->network_id;
		break;
	}
	case DECTNRP_CONFIG_TYPE_FILTER_SHORT_NETWORK_ID: {
		ctx->rx.filter.short_network_id_active = config->filter_short_network_id.activate;
		ctx->rx.filter.short_network_id = config->filter_short_network_id.value;
		break;
	}
	case DECTNRP_CONFIG_TYPE_FILTER_SHORT_RECEIVER_ADDR: {
		ctx->rx.filter.short_addr_active = config->filter_short_receiver_addr.activate;
		ctx->rx.filter.short_addr = config->filter_short_receiver_addr.value;
		break;
	}
	default:
		ret = -ENOTSUP;
		break;
	}
	return ret;
}

static int nrf91_get_time(const struct device *dev, net_time_t *time)
{
	struct nrf91_context *ctx = dev->data;
	LOG_DBG("nrf91_get_time(%s)", dev->name);

	int ret = 0;

	if (!atomic_test_bit(&ctx->state, RADIO_STATE_INITIALIZED)) {
		LOG_ERR("nrf91_get_time but !RADIO_STATE_INITIALIZED");
		ret = -EIO;
		goto error;
	}

	ret = k_sem_take(&ctx->operation, K_MSEC(10));
	if (ret < 0) {
		NET_ERR("nrf91_get_time() k_sem_take(operation) failed");
		ret = -EIO;
		goto error;
	}

	ret = nrf_modem_dect_phy_time_get();
	if (ret < 0) {
		NET_ERR("nrf_modem_dect_phy_time_get failed, %d", ret);
		ret = -EIO;
		goto out;
	}

	/* Block until time_get_cb has been called and semaphore was given back */
	ret = k_sem_take(&ctx->modemlock, K_MSEC(10));
	if (ret < 0) {
		NET_ERR("nrf91_get_time() k_sem_take(modem) failed");
		ret = -EIO;
		goto out;
	}

	*time = ctx->modem.time;
	LOG_INF("<%" PRIu64 "> nrf91_get_time()", ctx->modem.time);

out:
	k_sem_give(&ctx->operation);
error:
	return ret;
}

#if CONFIG_DECTNRP_DRIVER_SCHEDULED_API

static int nrf91_schedule(const struct device *dev, struct dectnrp_driver_op *op)
{
	struct nrf91_context *ctx = dev->data;
	LOG_DBG("nrf91_schedule(%s)", dev->name);

	int ret = 0;

	if (!atomic_test_bit(&ctx->state, RADIO_STATE_STARTED)) {
		LOG_ERR("nrf91-device not initialized yet, drop rx operation");
		ret = -EIO;
		goto out;
	}

	switch (op->type) {
	case DECTNRP_DRIVER_OP_TX: {

		uint8_t ctrl_size_type = op->tx.phy_header_type;
		uint8_t ctrl_size_bytes = ctrl_size_type == 0 ? DECTNRP_PHY_HEADER_TYPE1_SIZE
							      : DECTNRP_PHY_HEADER_TYPE2_SIZE;
		const struct dectnrp_transport_parameters *parameters =
			&op->tx.transport_parameters;

		if (parameters->mu != ctx->modem.mu) {
			NET_ERR("radio does not support mu=%d, expect mu=%d, drop data",
				parameters->mu, ctx->modem.mu);
			ret = -EINVAL;
			goto out;
		}
		if (parameters->beta != ctx->modem.beta) {
			NET_ERR("radio does not support beta=%d, expect beta=%d, drop data",
				parameters->beta, ctx->modem.beta);
			ret = -EINVAL;
			goto out;
		}

		struct net_buf *frag = op->tx.pkt->buffer;

		struct nrf_modem_dect_phy_tx_params tx_param = {
			.handle = (uintptr_t)op,
			.network_id = ctx->network_id,
			.phy_type = op->tx.phy_header_type,
			.carrier = op->channel,
			.phy_header = (union nrf_modem_dect_phy_hdr *)&frag->data[0],
			.data = &frag->data[ctrl_size_bytes],
			.data_size = frag->len - ctrl_size_bytes,
		};
		if (op->tx.mode.is_scheduled) {
			tx_param.start_time = op->start_time;
		} else {
			/* Immediate operation. */
			tx_param.start_time = 0;
		}

