Opener-Initiative/opener/drivers/dectnrp/dectnrp_nrf91.c
		if (op->tx.mode.is_lbt) {

			if (op->tx.lbt.period < NRF_MODEM_DECT_LBT_PERIOD_MIN) {
				NET_ERR("[%p]nrf91_schedule lbt.period %d to small, min=%d", op,
					op->tx.lbt.period, NRF_MODEM_DECT_LBT_PERIOD_MIN);
				ret = -EINVAL;
				goto out;
			} else if (op->tx.lbt.period > NRF_MODEM_DECT_LBT_PERIOD_MAX) {
				NET_ERR("[%p]nrf91_schedule lbt.period %d to big, min=%d", op,
					op->tx.lbt.period, NRF_MODEM_DECT_LBT_PERIOD_MAX);
				ret = -EINVAL;
				goto out;
			}
			tx_param.lbt_period = op->tx.lbt.period;
			tx_param.lbt_rssi_threshold_max = op->tx.lbt.rssi_threshold;
		} else {
			/* Without LBT */
			tx_param.lbt_period = 0;
			tx_param.lbt_rssi_threshold_max = 0;
		}

		LOG_DBG("[%p]<%lld> PHY TX", op, tx_param.start_time);
		LOG_HEXDUMP_DBG(&frag->data[0], frag->len, "PHY TX:");

		ret = k_sem_take(&ctx->operation, K_MSEC(10));
		if (ret < 0) {
			NET_ERR("[%p]nrf91_schedule k_sem_take failed,%d", op, ret);
			ret = -EIO;
		} else {
			ret = nrf_modem_dect_phy_tx(&tx_param);
			if (ret < 0) {
				NET_ERR("[%p]nrf_modem_dect_phy_tx failed,%d", op, ret);
				ret = -EIO;
			}
			k_sem_give(&ctx->operation);
		}

		break;
	}
	case DECTNRP_DRIVER_OP_RX: {

		struct nrf_modem_dect_phy_rx_params rx_params = {
			.handle = (uintptr_t)op,
			.network_id = ctx->network_id,
			.mode = NRF_MODEM_DECT_PHY_RX_MODE_SINGLE_SHOT,
			.link_id = NRF_MODEM_DECT_PHY_LINK_UNSPECIFIED,
			.rssi_level = 0, /* fast AGC algorithm */
			.carrier = op->channel,
			.duration = op->rx.duration};

		if (op->rx.mode.is_scheduled) {
			rx_params.start_time = op->start_time;
		} else {
			/** Immediate operation. */
			rx_params.start_time = 0; 
		}

		rx_params.filter.is_short_network_id_used = ctx->rx.filter.short_network_id_active;
		if (ctx->rx.filter.short_network_id_active) {
			rx_params.filter.short_network_id = ctx->rx.filter.short_network_id;
		}
		if (ctx->rx.filter.short_addr_active) {
			rx_params.filter.receiver_identity = ctx->rx.filter.short_addr;
		} else {
			// listen for everything (broadcast mode used)
			rx_params.filter.receiver_identity = 0;
		}
		LOG_DBG("[%p]<%lld> PHY RX", op, rx_params.start_time);

		ret = k_sem_take(&ctx->operation, K_MSEC(10));
		if (ret < 0) {
			NET_ERR("[%p]nrf91_schedule k_sem_take failed,%d", op, ret);
			ret = -EIO;
		} else {
			ret = nrf_modem_dect_phy_rx(&rx_params);
			if (ret < 0) {
				NET_ERR("[%p]nrf_modem_dect_phy_rx failed,%d", op, ret);
				ret = -EIO;
			}
			k_sem_give(&ctx->operation);
		}

		break;
	}
	case DECTNRP_DRIVER_OP_RSSI1: {

		struct nrf_modem_dect_phy_rssi_params rssi1_params = {
			.handle = (uintptr_t)op,
			.carrier = op->channel,
			.duration = op->rssi1.subslots,
			.reporting_interval = NRF_MODEM_DECT_PHY_RSSI_INTERVAL_24_SLOTS};

		if (op->rssi1.mode.is_scheduled) {
			rssi1_params.start_time = op->start_time;
		} else {
			/** Immediate operation. */
			rssi1_params.start_time = 0;
		}

		ret = k_sem_take(&ctx->operation, K_MSEC(100));
		if (ret < 0) {
			NET_ERR("[%p]nrf91_schedule k_sem_take failed,%d", op, ret);
			ret = -EIO;
		} else {
			ret = nrf_modem_dect_phy_rssi(&rssi1_params);
			if (ret < 0) {
				NET_ERR("[%p]nrf_modem_dect_phy_rssi failed,%d", op, ret);
				ret = -EIO;
			}
			k_sem_give(&ctx->operation);
		}

		break;
	}
	}

out:
	return ret;
}

#endif

#if CONFIG_DECTNRP_DRIVER_BLOCKING_API

static int nrf91_set_channel(const struct device *dev, uint16_t channel)
{
	ARG_UNUSED(dev);
	ARG_UNUSED(channel);
	return -ENOSYS;
}

static int nrf91_rx(const struct device *dev, struct dectnrp_rx_mode mode, net_time_t start,
		    uint32_t duration, struct net_pkt *pkt)
{
	ARG_UNUSED(dev);
	ARG_UNUSED(mode);
	ARG_UNUSED(start);
	ARG_UNUSED(duration);
	ARG_UNUSED(pkt);
	return -ENOSYS;
}

static int nrf91_tx(const struct device *dev, struct dectnrp_tx_mode mode, struct net_pkt *pkt,
		    struct net_buf *frag)
{
	ARG_UNUSED(dev);
	ARG_UNUSED(mode);
	ARG_UNUSED(pkt);
	ARG_UNUSED(frag);
	return -ENOSYS;
}

static int nrf91_rssi1(const struct device *dev, struct dectnrp_rssi_mode mode, uint32_t subslots,
		       struct dectnrp_rssi1_result *result)
{
	ARG_UNUSED(dev);
	ARG_UNUSED(mode);
	ARG_UNUSED(subslots);
	ARG_UNUSED(result);
	return -ENOSYS;
}

#endif /* CONFIG_DECTNRP_DRIVER_BLOCKING_API */

static int nrf91_init(const struct device *dev)
{
	int ret = 0;
	struct nrf91_context *ctx = dev->data;
	LOG_DBG("nrf91_init(%s)", dev->name);

	if (nrf91_dev != NULL) {
		/* This driver is only a singleton initialized once for now. */
		LOG_ERR("nrf91_init(%s) failed, init twice not supported for now", dev->name);
		ret = -EEXIST;
	} else {

		nrf91_dev = dev;
		ctx->upper_layer_event_handler = NULL;
		ctx->state = ATOMIC_INIT(RADIO_STATE_UNKNOWN);
		ctx->rx.state = ATOMIC_INIT(RADIO_RXSTATE_UNKNOWN);
		k_sem_init(&ctx->modemlock, 0, 1);
		k_sem_init(&ctx->operation, 0, 1);

		ret = nrf_modem_lib_init();
		if (ret < 0) {
			NET_ERR("nrf_modem_lib_init failed,0x%x", ret);
			ret = -EIO;
			goto error;
		}

		ret = verify_modem_fw_version(&ctx->mfw_version);
		if (ret < 0) {
			goto error;
		}
		log_fw_uuid();
		char *modem_lib_ver = nrf_modem_build_version();
		LOG_WRN("MFW lib-version:%s", modem_lib_ver);

		ret = nrf_modem_dect_phy_event_handler_set(modem_phy_event_handler);
		if (ret < 0) {
			NET_ERR("nrf_modem_dect_phy_event_handler_set failed,0x%x", ret);
			ret = -EIO;
			goto error;
		}

		ret = nrf_modem_dect_phy_init();
		if (ret < 0) {
			NET_ERR("nrf_modem_dect_phy_init failed,0x%x", ret);
			ret = -EIO;
			goto error;
		}
		ret = k_sem_take(&ctx->modemlock, K_MSEC(100));
		if (ret < 0) {
			NET_ERR("nrf_modem_dect_phy_init, k_sem_take failed");
			ret = -EIO;
			goto error;
		} else if (ctx->modem.last_status != NRF_MODEM_DECT_PHY_SUCCESS) {
			NET_ERR("nrf_modem_dect_phy_init failed,0x%x", ctx->modem.last_status );
			ret = -EIO;
			goto error;
		}

		static const struct nrf_modem_dect_phy_config_params init_params = {
			.band_group_index = CONFIG_DECTNRP_DRIVER_NRF91_BAND_GROUP,
			.harq_rx_process_count = 1,        /* TODO make it more flexible */
			.harq_rx_expiry_time_us = 5000000, /* TODO make it more flexible */
		};
		ret = nrf_modem_dect_phy_configure(&init_params);
		if (ret < 0) {
			NET_ERR("nrf_modem_dect_phy_init failed,0x%x", ret);
			ret = -EIO;
			goto error;
		}
		ret = k_sem_take(&ctx->modemlock, K_MSEC(500));
		if (ret < 0) {
			NET_ERR("nrf_modem_dect_phy_configure(), k_sem_take failed");
			ret = -EIO;
			goto error;
		} else if (ctx->modem.last_status != NRF_MODEM_DECT_PHY_SUCCESS) {
			NET_ERR("nrf_modem_dect_phy_configure failed,0x%x", ctx->modem.last_status);
			ret = -EIO;
			goto error;
		}

