Opener-Initiative/opener/drivers/dectnrp/dectnrp_nrf91.c
		ret = nrf_modem_dect_phy_capability_get();
		if (ret < 0) {
			NET_ERR("nrf_modem_dect_phy_capability_get failed,0x%x", ret);
			ret = -EIO;
			goto error;
		}
		ret = k_sem_take(&ctx->modemlock, K_MSEC(100));
		if (ret < 0) {
			NET_ERR("nrf_modem_dect_phy_capability_get, k_sem_take failed");
			ret = -EIO;
			goto error;
		} else if (ctx->modem.last_status != NRF_MODEM_DECT_PHY_SUCCESS) {
			NET_ERR("nrf_modem_dect_phy_capability_get failed,0x%x", ctx->modem.last_status);
			ret = -EIO;
			goto error;
		}

		ret = nrf_modem_dect_phy_band_get();
		if (ret < 0) {
			NET_ERR("nrf_modem_dect_phy_band_get failed,0x%x", ret);
			ret = -EIO;
			goto error;
		}
		ret = k_sem_take(&ctx->modemlock, K_MSEC(100));
		if (ret < 0) {
			NET_ERR("nrf_modem_dect_phy_band_get, k_sem_take failed");
			ret = -EIO;
			goto error;
		}

		ret = nrf_modem_dect_phy_latency_get();
		if (ret < 0) {
			NET_ERR("nrf_modem_dect_phy_latency_get failed,0x%x", ret);
			ret = -EIO;
			goto error;
		}
		ret = k_sem_take(&ctx->modemlock, K_MSEC(100));
		if (ret < 0) {
			NET_ERR("nrf_modem_dect_phy_latency_get, k_sem_take failed");
			ret = -EIO;
			goto error;
		}
	}

	LOG_INF("nrf91 dectnrp radio initialized");
	atomic_set_bit(&ctx->state, RADIO_STATE_INITIALIZED);
	goto out;
error:
	NET_INFO("dectnrp_nrf91 NOT initialized");
out:
	return ret;
}

static void nrf91_net_if_init(struct net_if *iface)
{
	const struct device *dev = net_if_get_device(iface);
	struct nrf91_context *ctx = dev->data;
	LOG_DBG("nrf91_net_if_init");

	if (ctx->iface != NULL) {
		/* This driver is only a singleton initialized once for now. */
		LOG_ERR("nrf91_net_if_init(%s) failed, init twice not supported for now", dev->name);
	} else {
		ctx->iface = iface;
		dectnrp_l2_init(ctx->iface);
		LOG_INF("Iface initialized");
	}
	return;
}

static struct nrf91_context context = {0};

static const struct dectnrp_driver_api nrf91_api = {
	.iface_api = { .init = nrf91_net_if_init},
	.start = nrf91_start,
	.stop = nrf91_stop,
	.get_capabilities = nrf91_get_capabilities,
	.configure = nrf91_configure,
	.get_time = nrf91_get_time,
#if CONFIG_DECTNRP_DRIVER_SCHEDULED_API
	.schedule = nrf91_schedule,
#endif
#if CONFIG_DECTNRP_DRIVER_BLOCKING_API
	.set_channel = nrf91_set_channel,
	.rx = nrf91_rx,
	.tx = nrf91_tx,
	.rssi1 = nrf91_rssi1,
#endif
};

NET_DEVICE_INIT(dectnrp_nrf91, "dectnrp_nrf91", nrf91_init, NULL, &context, NULL,
		CONFIG_KERNEL_INIT_PRIORITY_DEFAULT, &nrf91_api, DECTNRP_L2,
		NET_L2_GET_CTX_TYPE(DECTNRP_L2), DECTNRP_MTU);
